In [3]:
import pandas as pd
import numpy as np

In [5]:
l = np.array([[1,2,3], [4,5,6]])

pd.DataFrame(l)

   0  1  2
0  1  2  3
1  4  5  6

#### reading various file formats

In [21]:
df_csv = pd.read_csv('../data/iris.csv')

In [22]:
df_csv.head(7)

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa
5,5.4,3.9,1.7,0.4,setosa
6,4.6,3.4,1.4,0.3,setosa

In [5]:
df_csv.tail()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
145,6.7,3.0,5.2,2.3,virginica
146,6.3,2.5,5.0,1.9,virginica
147,6.5,3.0,5.2,2.0,virginica
148,6.2,3.4,5.4,2.3,virginica
149,5.9,3.0,5.1,1.8,virginica

In [6]:
df_csv.shape

(150, 5)

In [23]:
df_csv.dtypes

sepal_length_(cm)    float64
sepal_width_(cm)     float64
petal_length_(cm)    float64
petal_width_(cm)     float64
species               object
dtype: object

In [7]:
type(df_csv)

pandas.core.frame.DataFrame

In [12]:
type(df_csv['sepal_length_(cm)'])

pandas.core.series.Series

In [16]:
type(df_csv['sepal_length_(cm)'].values)

numpy.ndarray

In [17]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal_length_(cm)  150 non-null    float64
 1   sepal_width_(cm)   150 non-null    float64
 2   petal_length_(cm)  150 non-null    float64
 3   petal_width_(cm)   150 non-null    float64
 4   species            150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [18]:
df_csv.describe()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [19]:
df_csv.describe(percentiles= [0.95, 0.99])

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
50%,5.800000,3.000000,4.350000,1.300000
95%,7.255000,3.800000,6.100000,2.300000
99%,7.700000,4.151000,6.700000,2.500000
max,7.900000,4.400000,6.900000,2.500000

In [2]:
df_text = pd.read_csv('../data/OnlineRetail.txt', sep='\t', encoding='unicode_escape')

In [23]:
df_text.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 8:26,3.39,17850.0,United Kingdom

In [14]:
len(df_text['Country'].unique())

38

In [25]:
pd.DataFrame(round(df_text['Country'].value_counts(normalize = True),4)*100).to_csv('sample_extracted.csv', index = True)

Index(['United Kingdom', 'Germany', 'France', 'EIRE', 'Spain', 'Netherlands',
       'Belgium', 'Switzerland', 'Portugal', 'Australia', 'Norway', 'Italy',
       'Channel Islands', 'Finland', 'Cyprus', 'Sweden', 'Unspecified',
       'Austria', 'Denmark', 'Japan', 'Poland', 'Israel', 'USA', 'Hong Kong',
       'Singapore', 'Iceland', 'Canada', 'Greece', 'Malta',
       'United Arab Emirates', 'European Community', 'RSA', 'Lebanon',
       'Lithuania', 'Brazil', 'Czech Republic', 'Bahrain', 'Saudi Arabia'],
      dtype='object')

In [24]:
df_text['Sales_Value'] = df_text['Quantity'] * df_text['UnitPrice']

In [25]:
df_text.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Sales_Value
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 8:26,3.39,17850.0,United Kingdom,20.34

In [3]:
df_text_1 = pd.read_csv('../data/car.csv')

In [4]:
df_text_1.head()

,car_ID,symboling,CarName,fueltype,aspiration,doornumber,carbody,drivewheel,enginelocation,wheelbase,...,enginesize,fuelsystem,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
0,1,3,alfa-romero giulia,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495.0
1,2,3,alfa-romero stelvio,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500.0
2,3,1,alfa-romero Quadrifoglio,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500.0
3,4,2,audi 100 ls,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950.0
4,5,2,audi 100ls,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450.0

In [30]:
df_ttext = pd.read_table('../data/OnlineRetail.txt', encoding='unicode_escape')

In [31]:
df_ttext.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 8:26,3.39,17850.0,United Kingdom

In [37]:
df_ttext.index

RangeIndex(start=0, stop=541909, step=1)

In [14]:
df_json = pd.read_json('../data/movie.json')

In [15]:
df_json.head()

,David Smith,Brenda Peterson,Bill Duffy,Samuel Miller,Julie Hammel,Clarissa Jackson,Adam Cohen,Chris Duncan
Vertigo,4.0,3.0,4.5,NaN,NaN,5.0,3.5,NaN
Scarface,4.5,1.5,5.0,3.5,2.5,4.5,3.0,NaN
Raging Bull,3.0,1.0,NaN,5.0,NaN,4.0,NaN,4.5
Goodfellas,4.5,2.0,4.5,5.0,3.0,2.5,4.5,NaN
The Apartment,1.0,5.0,1.0,1.0,NaN,1.0,1.0,1.5

In [35]:
df_json.index

Index(['Vertigo', 'Scarface', 'Raging Bull', 'Goodfellas', 'The Apartment',
       'Roman Holiday'],
      dtype='object')

In [43]:
import sqlite3

connection = sqlite3.connect('../data/flights.db')

query = '''SELECT name FROM airlines LIMIT 15'''

df_sql = pd.read_sql_query(query, connection)

In [46]:
pd.read_sql_query('SELECT * FROM routes LIMIT 5', connection)

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2

In [5]:
import numpy as np

In [18]:

# create dataframe using numpy

pd.DataFrame(np.arange(0, 20).reshape(5, 4))

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [23]:
# 

l1 = [1, 2, 3]
l2 = [11, 22, 33]
l3 = [111, 222, 333, 444]

In [16]:
a1 = pd.DataFrame(l1)
print(a1)

   0
0  1
1  2
2  3

In [17]:
a2 = pd.Series(l1)
print(a2)

0    1
1    2
2    3
dtype: int64

In [14]:
a1.shape

(3, 1)

In [15]:
a2.shape

(3,)

In [20]:
l1 = pd.Series(l1)
l2 = pd.Series(l2)
l3 = pd.Series(l3)

In [21]:
l1 + l2 + l3

0    123.0
1    246.0
2    369.0
3      NaN
dtype: float64

In [27]:
# extraction of all the column names
df_text.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Sales_Value'],
      dtype='object')

In [30]:
for i in df_text.columns:

    print(i.lower())

invoiceno
stockcode
description
quantity
invoicedate
unitprice
customerid
country
sales_value

In [34]:
if df_text.columns[1] == 'StockCode':

    print('We will append d_ on stockcode')

We will append d_ on stockcode

In [3]:
# check for missing or null values

df_text.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [6]:
len(df_text), df_text.shape[0]

(541909, 541909)

In [11]:
round(df_text.isnull().sum() / df_text.shape[0], 4)*100

InvoiceNo       0.00
StockCode       0.00
Description     0.27
Quantity        0.00
InvoiceDate     0.00
UnitPrice       0.00
CustomerID     24.93
Country         0.00
dtype: float64

In [6]:
df_text.isnull().any()

InvoiceNo      False
StockCode      False
Description     True
Quantity       False
InvoiceDate    False
UnitPrice      False
CustomerID      True
Country        False
dtype: bool

In [7]:
# statistical measures

df_text.UnitPrice.min(), df_text.UnitPrice.max(), df_text.UnitPrice.mean()

(-11062.06, 38970.0, 4.611113626088513)

In [8]:
#loc and iloc

In [10]:
df_csv.loc[0]

sepal_length_(cm)       5.1
sepal_width_(cm)        3.5
petal_length_(cm)       1.4
petal_width_(cm)        0.2
species              setosa
Name: 0, dtype: object

In [13]:
df_csv.iloc[0]

sepal_length_(cm)       5.1
sepal_width_(cm)        3.5
petal_length_(cm)       1.4
petal_width_(cm)        0.2
species              setosa
Name: 0, dtype: object

In [12]:
df_csv.head()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [16]:
df_json.head()

,David Smith,Brenda Peterson,Bill Duffy,Samuel Miller,Julie Hammel,Clarissa Jackson,Adam Cohen,Chris Duncan
Vertigo,4.0,3.0,4.5,NaN,NaN,5.0,3.5,NaN
Scarface,4.5,1.5,5.0,3.5,2.5,4.5,3.0,NaN
Raging Bull,3.0,1.0,NaN,5.0,NaN,4.0,NaN,4.5
Goodfellas,4.5,2.0,4.5,5.0,3.0,2.5,4.5,NaN
The Apartment,1.0,5.0,1.0,1.0,NaN,1.0,1.0,1.5

In [17]:
df_json.loc['Vertigo']

David Smith         4.0
Brenda Peterson     3.0
Bill Duffy          4.5
Samuel Miller       NaN
Julie Hammel        NaN
Clarissa Jackson    5.0
Adam Cohen          3.5
Chris Duncan        NaN
Name: Vertigo, dtype: float64

In [18]:
df_json.iloc[0]

David Smith         4.0
Brenda Peterson     3.0
Bill Duffy          4.5
Samuel Miller       NaN
Julie Hammel        NaN
Clarissa Jackson    5.0
Adam Cohen          3.5
Chris Duncan        NaN
Name: Vertigo, dtype: float64

In [19]:
df_json.head()

,David Smith,Brenda Peterson,Bill Duffy,Samuel Miller,Julie Hammel,Clarissa Jackson,Adam Cohen,Chris Duncan
Vertigo,4.0,3.0,4.5,NaN,NaN,5.0,3.5,NaN
Scarface,4.5,1.5,5.0,3.5,2.5,4.5,3.0,NaN
Raging Bull,3.0,1.0,NaN,5.0,NaN,4.0,NaN,4.5
Goodfellas,4.5,2.0,4.5,5.0,3.0,2.5,4.5,NaN
The Apartment,1.0,5.0,1.0,1.0,NaN,1.0,1.0,1.5

In [21]:
# using Transpose
df_json.head().T

                  Vertigo  Scarface  Raging Bull  Goodfellas  The Apartment
David Smith           4.0       4.5          3.0         4.5            1.0
Brenda Peterson       3.0       1.5          1.0         2.0            5.0
Bill Duffy            4.5       5.0          NaN         4.5            1.0
Samuel Miller         NaN       3.5          5.0         5.0            1.0
Julie Hammel          NaN       2.5          NaN         3.0            NaN
Clarissa Jackson      5.0       4.5          4.0         2.5            1.0
Adam Cohen            3.5       3.0          NaN         4.5            1.0
Chris Duncan          NaN       NaN          4.5         NaN            1.5

In [33]:
a = pd.DataFrame(l1, index = [10, 4, 2], columns = ['col'])

In [34]:
a

    col
10    1
4     2
2     3

In [37]:
print(a.loc[10])

print(a.iloc[0])

col    1
Name: 10, dtype: int64
col    1
Name: 10, dtype: int64

In [40]:
df_csv['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [41]:
df_csv['species'].value_counts(normalize=True)

setosa        0.333333
versicolor    0.333333
virginica     0.333333
Name: species, dtype: float64

In [42]:
df_csv['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [44]:
df_csv['species'].value_counts()/len(df_csv)

setosa        0.333333
versicolor    0.333333
virginica     0.333333
Name: species, dtype: float64

In [45]:
len(df_csv)

150